tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
    Esp32BaseAppEvents::EventInput input;
    input.eventCode = 1002;
    input.reasonCode = 2101;
    input.objectId = 1;
    input.value1 = 1450;
    input.value2 = 2;
    input.flags = 0x0001;
    input.level = Esp32BaseAppEvents::Level::Warning;
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::append(input));

    EventCollector collected;
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readLatest(0, 10, collectEvent, &collected));
    TEST_ASSERT_EQUAL_UINT32(1, collected.events.size());
    TEST_ASSERT_EQUAL_UINT32(1, collected.events[0].recordId);
    TEST_ASSERT_EQUAL_UINT32(1002, collected.events[0].eventCode);
    TEST_ASSERT_EQUAL_UINT32(2101, collected.events[0].reasonCode);
    TEST_ASSERT_EQUAL_INT32(1450, collected.events[0].value1);
    TEST_ASSERT_EQUAL_UINT16(0x0001, collected.events[0].flags);
    Esp32BaseAppEvents::EventStoreStatus status;
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(48, status.storage.slotSizeBytes);
    TEST_ASSERT_EQUAL_UINT32(208, status.storage.currentStoreBytes);
}

int main(int argc, char** argv) {
    UNITY_BEGIN();
    RUN_TEST(test_create_calculates_capacity_and_store_budget);
    RUN_TEST(test_segment_rotation_reads_latest_first);
    RUN_TEST(test_smaller_budget_removes_oversized_old_segment_and_resets_visible_range);
    RUN_TEST(test_completed_record_uses_duration_and_resolves_time);
    RUN_TEST(test_corrupt_record_is_skipped_and_reported);
    RUN_TEST(test_corrupt_record_id_is_reported_and_read_as_corrupt);
    RUN_TEST(test_torn_tail_is_reserved_and_never_returned);
    RUN_TEST(test_corrupt_segment_header_is_skipped_but_store_remains_writable);
    RUN_TEST(test_tiny_corrupt_segment_reserves_its_filename_id);
    RUN_TEST(test_overlapping_segment_ranges_are_a_structural_fault);
    RUN_TEST(test_clear_hides_records_and_continues_ids);
    RUN_TEST(test_different_versions_use_different_directories);
    RUN_TEST(test_existing_control_wrong_size_is_not_rewritten);
    RUN_TEST(test_existing_definition_mismatch_is_not_rewritten);
    RUN_TEST(test_minimum_free_space_blocks_business_store_creation);
    RUN_TEST(test_latest_pagination_crosses_segments);
    RUN_TEST(test_torn_clear_header_falls_back_to_pre_clear_state);
    RUN_TEST(test_clear_boundary_stays_effective_when_segment_cleanup_fails);
    RUN_TEST(test_app_events_uses_compact_payload_and_default_budget);
    return UNITY_END();
}
